{
  "socA": {
    "title": "24th Society A",
    "years": "2023 - 2025",
    "President": {
      "title": "President",
      "name": "Ava Gogal",
      "program": "Mechanical Engineering",
      "about": "Hello! I'm Ava, a fourth-term Mechanical Engineering student, and I'm thrilled to announce that I will be serving as the President of Society 'A' for the next two years. I feel incredibly fortunate to have the opportunity to work with such a passionate and motivated group of individuals. Allow me to introduce myself further. In high school, I was elected as the student council president, where I gained valuable experience in this leadership position. During my time at MUN, I have participated in multiple student design teams, which have greatly contributed to my personal growth as a student. I have always been an adventurous person, seeking experiences that push me out of my comfort zone. Whether it's performing on stage or indulging in exhilarating activities like skydiving, I thrive on the thrill of new challenges. As the President of Society 'A', I have lots of exciting ideas and initiatives. My goal is to make the next few years the most memorable and successful for our society. I cannot wait to see what we will achieve together!",
      "photo": "/res/members/a2023/ava.jpeg",
      "link": "",
      "linkedin": "https://www.linkedin.com/in/avagogal/",
      "instagram": "https://www.instagram.com/avaflorencegogal"
    },
    "VP Academic": {
      "title": "VP Academic",
      "name": "Hannah Doyle",
      "program": "Mechanical Engineering",
      "about": "Hey everyone, I'm Hannah! I am a term 4 Mechanical Engineering student. I'm the new VP Academic for MUN Engineering Society 'A'!  My role involves attending appeals meetings, CUGS meetings, and serving as the student representative on the CUGS executive. I collaborate closely with faculty members to oversee changes in academic policies, appeal concerns and ensure that student voices are heard. Outside of school, I love traveling; I have been to 11 countries! I also love doing outdoor things including hiking with my dog! I'm super excited about my role as VP Academic and I'm always open to discussing anything academic-related. Feel free to reach out to me if you have any questions or just want to chat.",
      "photo": "/res/members/a2023/hannah.jpg",
      "link": "",
      "linkedin": "https://www.linkedin.com/in/hannah-doyle-a5387924b/",
      "instagram": "https://www.instagram.com/hannahclairedoyle"
    },
    "VP Finance": {
      "title": "VP Finance",
      "name": "Michael Mallay",
      "program": "Electrical Engineering",
      "about": "Hello! My name is Michael Mallay. Currently, I serve as the Vice President of Finance for MUN Engineering Society 'A', where I play a crucial role in managing the organization's financial aspects. Additionally, I am the Electrical and Finance Lead for MUN E-Motorsports, where I'm involved in the exciting project of designing an autonomous go-kart. Apart from my professional endeavors, I have a passion for cooking, finding joy in experimenting with new recipes and flavors. Sports have always been a significant part of my life, and I relish the thrill of competition and teamwork. Moreover, I have an ardent love for cars and electronics, fascinated by their engineering and technological advancements. I want to leverage my strong organizational skills to benefit the Society and contribute to its growth and success. Drawing from my previous experience, I have honed my financial expertise while building budgets for FMUNTENTH. During that time, I booked flights, arranged accommodations, managed transportation, and handled various other financial responsibilities. Being part of teams has been a consistent theme throughout my life, whether it is sports, student council, or design teams. I believe in the power of collaboration and understand the value of working together towards a common goal. With my dedication, leadership qualities, and diverse background, I am committed to making a positive impact in both my professional and personal pursuits.",
      "photo": "/res/members/a2023/michael.jpg",
      "link": "",
      "linkedin": "https://www.linkedin.com/in/michael-mallay-92a769221/",
      "instagram": "https://www.instagram.com/michael_mallay18"
    },
    "VP External": {
      "title": "VP External",
      "name": "Sophia White",
      "program": "Electrical Engineering",
      "about": "Hey everyone, my name is Sophia and I'm the new VP External for MUN Engineering Society 'A', which means that I am responsible for representing Society 'A' to external organizations, such as the Canadian Federation of Engineering Students (CFES) and the Atlantic Council of Engineering Students (ACES). I was previously the Junior VP External for Society 'A', so I'm super excited for another two years of representing MUN students on an atlantic and national level! I am also responsible for selecting students to attend ACES and CFES conferences, so anyone interested in attending a conference can reach out to me! Aside from Society, I am a part of the Enactus Memorial Project R3D team, which is currently working on a system to recycle plastics into 3D-printer filament! Outside of school, I love painting, traveling, and going on walks with my dog! Feel free to reach out to me with any questions about conferences, ACES or the CFES, or anything you would like to chat about.",
      "photo": "/res/members/a2023/sophia.png",
      "link": "",
      "linkedin": "https://www.linkedin.com/in/sophiacw/",
      "instagram": "https://www.instagram.com/sophiacwhite"
    },
    "VP Internal": {
      "title": "VP Internal",
      "name": "Jacob Gillis",
      "program": "Electrical Engineering",
      "about": "Hey, I'm Jacob! I'm the VP Internal on your Society A! I'm involved with a few things to go along with my studies in Electrical Engineering. I play baseball, basketball and volleyball, which takes up a good chunk of my time. At MUN, I'm on the student team, MUN-E-Motorsports and we have competed at one competition in San Antonio for autonomous race cars and hope to attend as many as we can in the next few years! As for a few facts about me, I love sushi, buffalo chicken dip and spaghetti. My favorite TV shows are Brooklyn 99 and New Girl! I'm excited for the next two years on Society A and we will do all we can to make it as fun as possible for everyone!",
      "photo": "/res/members/a2023/jacob.PNG",
      "link": "",
      "linkedin": "https://www.linkedin.com/in/jpj-gillis/",
      "instagram": "https://www.instagram.com/jacobgillis13"
    },
    "Director of Communications": {
      "title": "Director of Communications",
      "name": "Russell Corbett",
      "program": "Computer Engineering",
      "about": "Hello! My name is Russell Corbett. I enjoy finding innovative solutions while balancing my academic pursuits and extracurricular commitments. I am a tech enthusiast and an avid basketball player, I mean, with this height, it's mandatory. The weather is fine up here and yes, I can reach the top shelf for you. In my free time, I enjoy going on drives, biking, and investigating history (Fun fact: I have traced my family back to 1590!) I strive to develop my technical skills in engineering teams like Eastern Edge Robotics and MUN E-Motorsports as Software Lead and a member of the software team respectively. I am the Technical Lead of the MUN Relay for Life Committee where I volunteer my time to fundraise for cancer research. Additionally, I actively engage in other volunteering initiatives like Mount Pearl Lions Club, First Lego League, and the MATE ROV Regional. I undertake personal projects such as designing Smart Home systems and creating websites for my own portfolio as well as many student organizations. My goal in society will be to connect more students to events going on throughout the campus and keep you up to date on all the fun stuff coming up!",
      "photo": "/res/members/a2023/russell.jpg",
      "link": "https://russellcorbett.ca/",
      "linkedin": "https://www.linkedin.com/in/russell-corbett",
      "instagram": "https://www.instagram.com/russell_corbett"
    },
    "Director of Outreach": {
      "title": "Director of Outreach",
      "name": "Kate Williams",
      "program": "Electrical Engineering",
      "about": "Hi everyone! My name is Kate Williams, term 4 Electrical Engineering and I'm the Director of Outreach for 2023-2025 Society 'A'! I'm a busy body so I'm involved in a couple other things besides society here on campus. To start, I'm on the MUN Seahawks Swim Team. We practice here on campus either in the Aquarina or the MUN pool. I love being a part of the varsity program here at school, the team is like my second family. I also get super cool travel opportunities because of swimming as well! Just this past season I was able to compete at Acadia, Dalhousie, and at the University of Victoria! To stay on the train of cool travel opportunities, I am also on an engineering student design team here at MUN called MUN E-Motorsports, formerly known as FMUNTENTH. We just competed in an international autonomous vehicle competition in San Antonio, Texas, where our team built a small autonomous car that was able to drive itself around a track and race other cars. We have our goals set higher for this year, and are planning to compete at the EV Grand Prix held by Perdue University that will require us to build an autonomous Go-kart. On another note, some fun facts about me are that my favorite artist is Taylor Swift (please come to Canada), my favorite food is a dynamite roll from Sun Sushi, and my dream vacation destination is the Amalfi Coast, Italy. I'm really looking forward to helping plan fun events, bringing new exciting things to our awesome faculty, and making these the best 2 years possible!",
      "photo": "/res/members/a2023/kate.jpg",
      "link": "",
      "linkedin": "https://www.linkedin.com/in/km-williams/",
      "instagram": "https://www.instagram.com/katewilliams13"
    },
    "Director of Social Events": {
      "title": "Director of Social Events",
      "name": "Kait Abbott",
      "program": "Mechanical Engineering",
      "about": "Hi everyone! My name is Kait, I’m a Mechanical Engineering student and I’m the Director of Social Events for 2023-2025 Society ‘A’! As the social events director, I’m all about creating fun inclusive events to bring our engineering community closer together. When I’m not busy with school, I enjoy playing various team sports but my favorite has to be volleyball. I play on a ladies league team sponsored by Georgetown Pub and I also play on a Co-ed team called CET with a few other engineering students. In collaboration with the Director of Sports, we are looking to plan multiple events that involve team sports and activities to help foster the community environment in the MUN engineering faculty. Along with this, I am also a part of Phoenix Aerospace as a mechanical team member. With this team, we are designing a remotely operated aircraft to compete in the AIAA Design/Build/Fly Competition hosted by Raytheon Technologies in Tucson, AZ in April of 2024. In my spare time, I enjoy going for walks, going to the gym, spending time with my sister and traveling as much as I can. I’m looking forward to what this Society has in store!",
      "photo": "/res/members/a2023/kait.jpg",
      "link": "",
      "linkedin": "https://www.linkedin.com/in/kaitlyn-abbott-9b495322b/",
      "instagram": "https://www.instagram.com/kait.abbott"
    },
    "Director of Sports": {
      "title": "Director of Sports",
      "name": "Eli Brown",
      "program": "Electrical Engineering",
      "about": "Hey everyone, my name is Eli Brown, I'm in Electrical Engineering and I am Director of Sports for MUN Engineering Society 'A'. I am passionate about sports and believe that they make everything better (even an engineering degree). I'm excited to see everyone at intramural events over the next few years and hope that we can all have some fun together. Along with society, I am also a member of Iceberg ASV, a student design team creating an autonomous surface vehicle that competes in a yearly international competition. As a member of the electrical team I mainly work on power distribution and controls as well as soldering anything I can get my hands on. I am also very interested in biomedical applications of electrical engineering and am looking forward to learning more about the field through academic courses as well as personal projects. Outside of school I like to hike with my dog Dirk, go for runs, box, play basketball and listen to music. I'm looking forward to working with the rest of Soc ‘A' to make these next few years ones to remember!",
      "photo": "/res/members/a2023/eli.JPG",
      "link": "",
      "linkedin": "https://www.linkedin.com/in/eli--brown/",
      "instagram": "https://www.instagram.com/elibrown.4"
    },
    "Director of Co-op": {
      "title": "Director of Co-op",
      "name": "Harnoor Singh",
      "program": "Computer Engineering",
      "about": "Hi everyone! My name is Harnoor, and I am the Director of Co-op for Society 'A'. I am in Computer Engineering at MUN, and I am most passionate about solving technical problems. I have been learning about and using Data Engineering, Machine Learning and other Artificial Intelligence techniques since my first work term, and looking forward to developing these skills as my degree progresses. I am also looking forward to helping students with all things co-op (and anything else too).",
      "photo": "/res/members/a2023/harnoor.jpg",
      "link": "",
      "linkedin": "https://www.linkedin.com/in/harnoorsingh05/",
      "instagram": ""
    },
    "Director of International Representation": {
      "title": "Director of International Representation",
      "name": "Abdelrahman Mohamed",
      "program": "Process Engineering",
      "about": "Hello! My name is Abdelrahman Mohamed, a Process Engineering student, and I am the Director of International Representation for the 2023-2025 Society ‘A'! I am very passionate about organizing events, volunteering, as well as equity, diversity, and inclusion. I'm very excited to help everyone feel more included and make the most out of their experience in engineering. For the past year, I have been the Equity, Diversity, and Inclusion Commissioner with the Atlantic Council of Engineering Students. Additionally, I was on the communications committee of the Canadian Engineering Leadership Conference that was held at MUN in 2022. I also work with the Hibernia Enhanced Oil Recovery group here on campus as a lab assistant. Outside of school, I love going out, traveling, going to concerts, making and editing videos.",
      "photo": "/res/members/a2023/abdelrahman.jpg",
      "link": "",
      "linkedin": "https://www.linkedin.com/in/abdelrahmanmohamed-/",
      "instagram": ""
    }
  },
  "socB": {
    "title": "23rd Society B",
    "years": "2022 - 2024",
    "President": {
      "title": "President",
      "name": "Ben Oates",
      "program": "Mechanical Engineering",
      "about": "Hey guys! I'm proud to serve as your President of Society B. I'm in Mechanical, class of 2025. If I'm not in the Society room or studying in the basement of the engineering building, you can find me in the Baja garage, out for a hike, at the cabin, or down at Quidi Vidi Brewery. Fun fact about me is that I can play the accordion! If you ever have any questions or concerns about all things Soc B, please feel free to shoot me an email or come see me in person. Looking forward to serving you & delivering good times!",
      "photo": "/res/members/b2022/ben_oates.jpeg",
      "link": "",
      "contact": "president.munengsocb@gmail.com",
      "linkedin": "https://www.linkedin.com/in/benjamin-oates-02/",
      "instagram": "https://www.instagram.com/boates02"
    },
    "VP Academic": {
      "title": "VP Academic",
      "name": "Fares Khalil",
      "program": "Computer Engineering",
      "about": "I like travelling so much. When I was in Egypt, I visited a lot of places all the way to Aswan in Upper Egypt and Sharm El Sheikh in Sinai. When I came to Canada, I still visited a lot of placed from St. John's to Calgary. I am hoping I will be able to go all the way to Vancouver and visit more places all around the world!",
      "photo": "/res/members/b2022/fares_khalil.jpeg",
      "link": "",
      "contact": "academic.munengsocb@gmail.com",
      "linkedin": "https://www.linkedin.com/in/fares-khalil/",
      "instagram": ""
    },
    "VP Finance": {
      "title": "VP Finance",
      "name": "Nadia Marmouche",
      "program": "Process Engineering",
      "about": "",
      "photo": "/res/members/b2022/nadia_marmouche.jpeg",
      "link": "",
      "contact": "finance.munengsocb@gmail.com",
      "linkedin": "https://www.linkedin.com/in/nadia-marmouche/",
      "instagram": ""
    },
    "VP External": {
      "title": "VP External",
      "name": "Kathleen Curran",
      "program": "Mechanical Engineering",
      "about": "Hi! I'm the Vice President External of Society B. I'm in the Mechanical Engineering class of 2025, and I'm also the class representative! I travel across Canada to represent the best interests of MUN Engineering at conferences and meetings. You'll usually find me studying in the mech room, or at the rink - I love to figure skate. Shoot me an email anytime with questions or concerns, or to attend a conference!",
      "photo": "/res/members/b2022/kathleen_curran.jpeg",
      "link": "",
      "contact": "external.munengsocb@gmail.com",
      "linkedin": "https://www.linkedin.com/in/kathleencurrann/",
      "instagram": ""
    },
    "VP Internal": {
      "title": "VP Internal",
      "name": "Matthew Rogers",
      "program": "Mechanical Engineering",
      "about": "",
      "photo": "/res/members/b2022/matthew_rogers.jpeg",
      "contact": "internal.munengsocb@gmail.com",
      "link": "",
      "linkedin": "https://www.linkedin.com/in/matthew-rogers-a25929198/",
      "instagram": ""
    },
    "Director of Communications": {
      "title": "Director of Communications",
      "name": "Veronica Naterer",
      "program": "Mechanical Engineering",
      "about": "",
      "photo": "/res/members/b2022/veronica_naterer.png",
      "link": "",
      "contact": "communications.munengsocb@gmail.com",
      "linkedin": "https://www.linkedin.com/in/veronicanaterer/",
      "instagram": ""
    },
    "Director of Outreach": {
      "title": "Director of Outreach",
      "name": "Paige Bodnar",
      "program": "Ocean and Naval Architectural Engineering",
      "about": "Hi! I'm Paige Bodnar - director of outreach! I'm a senior ONAE student who is maybe slightly obsessed with boats and the ocean. My hobbies are centered around cool things outside. My job is to spread the word about MUN engineering and make it as accessible as possible. You can usually find me in the ONAE room, I promise I'm not that far out(of)reach!",
      "photo": "/res/members/b2022/paige_bodnar.jpeg",
      "link": "",
      "contact": "outreach.munengsocb@gmail.com",
      "linkedin": "https://www.linkedin.com/in/paige-bodnar-77293018a/",
      "instagram": ""
    },
    "Director of Social Events": {
      "title": "Director of Social Events",
      "name": "Abby Sparrow",
      "program": "Mechanical Engineering",
      "about": "",
      "photo": "/res/members/b2022/abby_sparrow.jpeg",
      "link": "",
      "contact": "events.munengsocb@gmail.com",
      "linkedin": "https://www.linkedin.com/in/abby-sparrow-023004220/",
      "instagram": ""
    },
    "Director of Sports": {
      "title": "Director of Sports",
      "name": "Nathan Flynn",
      "program": "Mechanical Engineering",
      "about": "",
      "photo": "/res/members/b2022/nathan_flynn.jpeg",
      "link": "",
      "contact": "sports.munengsocb@gmail.com",
      "linkedin": "https://www.linkedin.com/in/nathan-john-flynn/",
      "instagram": ""
    },
    "Director of Co-op": {
      "title": "Director of Co-op",
      "name": "Jordan Careen",
      "program": "Mechanical Engineering",
      "about": "",
      "photo": "/res/members/b2022/jordan_careen.jpeg",
      "link": "",
      "contact": "coop.munengsocb@gmail.com",
      "linkedin": "https://www.linkedin.com/in/jordancareen/",
      "instagram": ""
    },
    "Director of International Representation": {
      "title": "Director of International Representation",
      "name": "Sayed Ahmed",
      "program": "Civil Engineering",
      "about": "",
      "photo": "/res/members/b2022/sayed_ahmed.jpeg",
      "link": "",
      "contact": "outreach.munengsocb@gmail.com",
      "linkedin": "https://www.linkedin.com/in/sayed-ahmed-sxa3b/",
      "instagram": ""
    }
  }
}