{
  "1930": {
    "description": "Three-year engineering diploma program available. Graduates attended other institutions to complete their engineering degrees. Dr. Thomas H. Winter was the first engineering professor, who supervised 13 students. Some students of this first class were Dr. J. B. Angel, Ralph Higgins, Clarence Knight, R. V. Moores, Dr. Clarence Powell and Walter Woolfrey."
  },
  "1934": {
    "description": "Dr. G. A. Frecker took over engineering teaching duties for one year, followed by S. J. Hayes, who served from 1935-1941."
  },
  "1941": {
    "description": "Stanley Carew replaced Prof. Hayes as the sole engineering professor until John M. Facey joined him in 1946."
  },
  "1949": {
    "description": "Memorial University College became a full-fledged university and was renamed Memorial University of Newfoundland."
  },
  "1950": {
    "description": "The Engineering Department became part of the Faculty of Applied Science with Professor Stanley J. Carew as its first dean, until 1968."
  },
  "1955": {
    "description": "Another faculty member joined. By 1966 there were six faculty members teaching more than 400 engineering students."
  },
  "1968": {
    "description": "Dr. Wright recommended Dr. Angus Bruneau, a faculty member at the University of Waterloo, as a candidate for leading the new co-operative engineering degree program at Memorial. Dr. Bruneau served as the founding dean of the new Faculty of Engineering and Applied Science between 1969 and 1974. Dr. Bruneau emphasized the importance of cold oceans engineering and oil and gas for the province and Memorial through speeches and pioneering research projects."
  },
  "1969": {
    "description": "Memorial began its own degree-granting co-operative engineering program. Undergraduate degrees (B.Eng.) were offered in three disciplines: civil, mechanical and electrical engineering - as well as a new master of engineering (M.Eng.) degree in ocean engineering. The faculty established the Ocean Engineering Research centre (OERC). Several new faculty members were hired, including Dr. John Molgaard; Dr. Cal Noble; Dr. Robert Dempster; and Dr. John Allen."
  },
  "1970": {
    "description": "First substantial investigation of iceberg dynamics. Over 18 days, seven icebergs were towed at sea by the Chimo vessel, Percy M. Crosbie. This project and Low Temperature Ocean Research Activity (LORA), a cylindrical laboratory for conducting underwater research were both initiated by Drs. Bruneau and Dempster."
  },
  "1971": {
    "description": "Memorial offered a new doctor of philosophy (PhD) degree in ocean engineering. The underwater habitat, LORA, was completed and installed at Broad Cove near St. Phillip's in Conception Bay."
  },
  "1972": {
    "description": "A radar system was purchased by the faculty for an iceberg dynamics project and located at the U.S. Army base at Saglak, North Labrador, to pursue studies of iceberg drift along the Labrador coast."
  },
  "1974": {
    "description": "Memorial’s first electrical, mechanical and civil engineers (cohort of 76 students) graduated with a bachelor of engineering degree. Dr. Robert Dempster served as dean between 1974 and 1980."
  },
  "1975": {
    "description": "C-CORE was established with Harold Snyder as its first director. Hillary Dawson became the first female to graduate from Memorial with a degree in engineering. St. John's became a hub for cold oceans research and development (R&D) leading to the establishment of NORDCO and the NRC facility in ocean, coastal and river engineering was relocated from Ottawa to St. John's. In November of this year, the Faculty moved to the new engineering building, which was officially opened two years later, in 1977, and named the S.J. Carew Building."
  },
  "1976": {
    "description": "The undergraduate co-operative engineering program was granted accreditation by the Canadian Accreditation Board for a full five-year period. The chair of the review committee noted that the curriculum design at Memorial was one of the finest he had seen in Canada. A proposal to establish a new undergraduate program in shipbuilding engineering was presented to Senate and the Board of Regents and the program received approval in principle to begin."
  },
  "1977": {
    "description": "The new engineering building, the S.J. Carew Building, was officially opened and named the S.J. Carew Building."
  },
  "1979": {
    "description": "Bill Milne, a partner in the naval architecture firm of German and Milne, joined the Faculty as a professor to launch the new shipbuilding program."
  },
  "1980": {
    "description": "The Faculty had seven professors, 27 associate professors, nine assistant professors and two forestry professors. There were strong research programs in all of the disciplines. Between 1980 and 1982, Dr. Colin D. DiCenzo served as dean."
  },
  "1982": {
    "description": "A fourth undergraduate discipline in shipbuilding engineering was introduced (in 1997 the name was changed to ocean and naval architectural engineering). The university had the only ocean and naval architectural engineering program in Canada and the only co-op program in this discipline in North America. From 1982-1992, Dr. G. Ross Peters served as dean."
  },
  "1991": {
    "description": "A new computer engineering program was launched."
  },
  "1993": {
    "description": "Between 1993 and 2002, Dr. Rangaswamy Seshadri served as dean."
  },
  "1996": {
    "description": "Engineering students built a formula-style race car and tested it at an international competition in Pontiac, Michigan. What began in 1996 as a final term design project later became an annual event with student teams participating in international design competitions."
  },
  "2002": {
    "description": "From 2002-2003, Dr. Mahmoud Haddara served as interim dean."
  },
  "2003": {
    "description": "Dr. Raymond G. Gosine served as dean from 2003 until 2008."
  },
  "2004": {
    "description": "A new professional course-based master’s program in computer engineering is introduced. The program led to a master of applied science (MASc.) degree in computer engineering, or MASCE. The introduction of this program provided a wider choice of courses for all graduate students and design projects that are directly relevant to community and/or industry partners."
  },
  "2005": {
    "description": "Course-based MASc. program was offered in environmental systems engineering and management (MESEM)."
  },
  "2006": {
    "description": "The main lecture theatre was dedicated to former dean, Dr. Angus Bruneau."
  },
  "2008": {
    "description": "Dr. John E. Quaicoe served as dean pro tempore from 2008-2011. A new process engineering program was introduced (its first successful accreditation was in 2013). The undergraduate program shifted from six to five years in duration. (This subsequently led to a “double cohort” of engineering students who graduated together in a single cohort in 2013.)"
  },
  "2009": {
    "description": "A course-based MASc. program in oil and gas engineering was offered."
  },
  "2011": {
    "description": "Dr. Ramachandran Venkatesan served as dean pro tempore from 2011-2012."
  },
  "2012": {
    "description": "Dr. Greg F. Naterer served as dean from July 2012 to April 2022."
  },
  "2014": {
    "description": "The Suncor Energy Offshore Offshore R&D Centre was opened. This 14,200 sq ft expansion of the S.J. Carew Building enables large offshore engineering research projects to be carried out in collaboration with industry partners. The faculty launched a new Memorial Centre for Entrepreneurship (MCE) in partnership with the Faculty of Business Administration."
  },
  "2016": {
    "description": "Construction began on the new core science and engineering building. The project (425,000 sq ft) will enable the expansion of engineering with modern, world-class laboratories and facilities."
  },
  "2018": {
    "description": "The faculty achieved national leadership in student diversity and women in engineering. For the fourth year in a row, Newfoundland and Labrador had the highest percentage of female undergraduate engineering students (26.9%) in Canada."
  },
  "2019": {
    "description": "A new energy systems engineering (MESE) graduate program is launched."
  },
  "2022": {
    "description": "Dr. Octavia A. Dobre was appointed as interim dean. She is the first female dean of the faculty."
  },
  "1960s": {
    "description": "Dr. Stanley J. Carew, dean of the Faculty of Applied Science, proposed to expand the diploma program to a full-degree program."
  },
  "1962-1967": {
    "description": "Dr. Moses Morgan, vice-president, Memorial University of Newfoundland, supported the idea to develop a degree-granting engineering program at Memorial. He solicited concepts from three engineering deans at Ontario universities, including Dr. Doug Wright of the University of Waterloo, who had recently developed a co-operative engineering program."
  },
  "Present": {
    "description": "The Faculty has grown to over 1,300 undergraduate and 680 graduate students, six accredited undergraduate programs, over 1,200 co-op work term placements per year, 20 graduate programs and over $10 million per year in annual research funding. A new undergraduate mechatronics program was launched. Two new graduate programs in artificial intelligence and software engineering were launched. Dr. Octavia A. Dobre is interim dean, making history as the faculty's first female dean."
  }
}